# Análisis Comparativo de Edades y Géneros para la Contratación de Personal

Este estudio ...

## Requisitos

In [ ]:
! pip install pandas

## 1. Datos de Edades y Géneros

In [16]:
import pandas as pd

edades = pd.Series([18, 25, 33, 56, 17, 29, 11, 54, 35])
generos = pd.Series(["M", "M", "H", "M", "H", "H", "H", "M", "M"])

data = pd.DataFrame({
    "EDAD": edades,
    "GENERO": generos
})

data["EDAD_2"] = data["EDAD"].map( lambda edad: int( (edad + 1) / 10 ) )

data

   EDAD GENERO  EDAD_2
0    18      M       1
1    25      M       2
2    33      H       3
3    56      M       5
4    17      H       1
5    29      H       3
6    11      H       1
7    54      M       5
8    35      M       3

In [23]:
mujeres = data.query("GENERO == 'M'")

mujeres

   EDAD GENERO  EDAD_2
0    18      M       1
1    25      M       2
3    56      M       5
7    54      M       5
8    35      M       3

In [24]:
len(mujeres)

5

In [25]:
sum(mujeres["EDAD"])

188

In [26]:
hombres = data.query("GENERO == 'H'")

hombres

   EDAD GENERO  EDAD_2
2    33      H       3
4    17      H       1
5    29      H       3
6    11      H       1

In [27]:
hombres.describe()

            EDAD    EDAD_2
count   4.000000  4.000000
mean   22.500000  2.000000
std    10.246951  1.154701
min    11.000000  1.000000
25%    15.500000  1.000000
50%    23.000000  2.000000
75%    30.000000  3.000000
max    33.000000  3.000000

In [28]:
len(hombres)

4

In [29]:
sum(hombres["EDAD"])

90

In [30]:
sum(hombres["EDAD"]) / len(hombres)

22.5